{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 10,
      "content": "[M]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "a": 2,
      "b": 3,
      "c": 4,
      "d": 5,
      "Ġa": 6,
      "Ġb": 7,
      "Ġc": 8,
      "Ġd": 9
    },
    "merges": [
      "Ġ a",
      "Ġ b",
      "Ġ c",
      "Ġ d"
    ]
  }
}
